package main

import (
	"encoding/csv"
	"fmt"
	"io"
	"strings"
)

var csvSource = `01101,"060  ","0600000","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｲｶﾆｹｲｻｲｶﾞﾅｲﾊﾞｱｲ","北海道","札幌市中央区","以下に掲載がない場合",0,0,0,0,0,0
01101,"064  ","0640941","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｱｻﾋｶﾞｵｶ","北海道","札幌市中央区","旭ケ丘",0,0,1,0,0,0
01101,"060  ","0600041","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｵｵﾄﾞｵﾘﾋｶﾞｼ","北海道","札幌市中央区","大通東",0,0,1,0,0,0
01101,"060  ","0600042","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｵｵﾄﾞｵﾘﾆｼ(1-19ﾁﾖｳﾒ)","北海道","札幌市中央区","大通西（１〜１９丁目）",1,0,1,0,0,0
01101,"064  ","0640820","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｵｵﾄﾞｵﾘﾆｼ(20-28ﾁﾖｳﾒ)","北海道","札幌市中央区","大通西（２０〜２８丁目）",1,0,1,0,0,0
01101,"060  ","0600031","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｷﾀ1ｼﾞﾖｳﾋｶﾞｼ","北海道","札幌市中央区","北一条東",0,0,1,0,0,0
01101,"060  ","0600001","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｷﾀ1ｼﾞﾖｳﾆｼ(1-19ﾁﾖｳﾒ)","北海道","札幌市中央区","北一条西（１〜１９丁目）",1,0,1,0,0,0
01101,"064  ","0640821","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｷﾀ1ｼﾞﾖｳﾆｼ(20-28ﾁﾖｳﾒ)","北海道","札幌市中央区","北一条西（２０〜２８丁目）",1,0,1,0,0,0
01101,"060  ","0600032","ﾎﾂｶｲﾄﾞｳ","ｻﾂﾎﾟﾛｼﾁﾕｳｵｳｸ","ｷﾀ2ｼﾞﾖｳﾋｶﾞｼ","北海道","札幌市中央区","北二条東",0,0,1,0,0,0
`

func main() {
	reader := strings.NewReader(csvSource)
	csvReader := csv.NewReader(reader)
	for {
		line, err := csvReader.Read()
		if err == io.EOF {
			break
		}
		fmt.Println(line[2], line[6:9])
	}
}
